notes/meeting_2022dec18.org
* meeting notes December 18, 2022
** the raku study group
**** usual links
***** these notes
****** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022dec18.md
****** source file (for corrections, etc)
******* https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022dec18.org
***** code examples
****** https://github.com/doomvox/raku-study/tree/main/bin/2022dec18
***** last meeting notes
****** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022nov20.md

** topics
*** meeting schedule: back to every-other, with one on new years day

*** jj merelo, "Raku Recipies"

*** weekly challenge
**** https://theweeklychallenge.org/blog/perl-weekly-challenge-191/#TASK2
***** skipped bruce gray's solution last time
****** https://github.com/manwar/perlweeklychallenge-club/blob/master/challenge-190/bruce-gray/raku/ch-2.raku


**** most recent: https://theweeklychallenge.org/blog/perl-weekly-challenge-195/


** announcements 
*** need to check in with lambert lum, who was looking for raku speakers for svperl on Jan 5, 2023

*** next meeting: January 1st, the day after amateur night


