notes/meeting_2022dec18.md
- [meeting notes December 18, 2022](#org0b5001b)
  - [the raku study group](#orgab2931e)
  - [topics](#orgcb895a7)
    - [meeting schedule: back to every-other, with one on new years day](#org869f22b)
    - [jj merelo, "Raku Recipies"](#org66290fc)
    - [weekly challenge](#org3675928)
  - [announcements](#orgf1717e9)
    - [need to check in with lambert lum, who was looking for raku speakers for svperl on Jan 5, 2023](#org96e1b66)
    - [next meeting: January 1st, the day after amateur night](#org634ea5f)


<a id="org0b5001b"></a>

# meeting notes December 18, 2022


<a id="orgab2931e"></a>

## the raku study group

1.  usual links

    1.  these notes
    
        1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022dec18.md>
        
        2.  source file (for corrections, etc)
        
            1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022dec18.org>
    
    2.  code examples
    
        1.  <https://github.com/doomvox/raku-study/tree/main/bin/2022dec18>
    
    3.  last meeting notes
    
        1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022nov20.md>


<a id="orgcb895a7"></a>

## topics


<a id="org869f22b"></a>

### meeting schedule: back to every-other, with one on new years day


<a id="org66290fc"></a>

### jj merelo, "Raku Recipies"


<a id="org3675928"></a>

### weekly challenge

1.  <https://theweeklychallenge.org/blog/perl-weekly-challenge-191/#TASK2>

    1.  skipped bruce gray's solution last time
    
        1.  <https://github.com/manwar/perlweeklychallenge-club/blob/master/challenge-190/bruce-gray/raku/ch-2.raku>

2.  most recent: <https://theweeklychallenge.org/blog/perl-weekly-challenge-195/>


<a id="orgf1717e9"></a>

## announcements


<a id="org96e1b66"></a>

### need to check in with lambert lum, who was looking for raku speakers for svperl on Jan 5, 2023


<a id="org634ea5f"></a>

### next meeting: January 1st, the day after amateur night
